benchmark-results/affinity-test-2/12-2.txt
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:0 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern G:G
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 100000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern G:G
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern R:R
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 100000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern R:R
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  34 secs]  0 threads:    96000000 ops, 2785102 (avg: 2789443) ops/sec, 180.32MB/sec (avg: 180.60MB/sec),  0.28 (avg:  0.27) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      2814642.92          ---          ---         0.27503         0.27900         0.28700         0.29500         0.30300         0.31900         2.54300         2.57500         2.65500        47.10300    186605.09
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    2814642.92         0.00         0.00         0.27503         0.27900         0.28700         0.29500         0.30300         0.31900         2.54300         2.57500         2.65500        47.10300    186605.09
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  29 secs]  0 threads:    96000000 ops, 3529161 (avg: 3302252) ops/sec, 147.01MB/sec (avg: 137.53MB/sec),  0.22 (avg:  0.23) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       327556.43          ---          ---         0.23244         0.25500         0.27900         0.28700         0.30300         0.31100         1.58300         1.71900         1.81500        48.12700     21749.61
Gets      3275528.22     36307.72   3239220.50         0.23216         0.25500         0.27900         0.28700         0.30300         0.31100         1.55100         1.71100         1.79100        48.12700    131905.94
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    3603084.65     36307.72   3239220.50         0.23218         0.25500         0.27900         0.28700         0.30300         0.31100         1.55100         1.71100         1.79100        48.12700    153655.55
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads:     9600000 ops,  906177 (avg:  879698) ops/sec, 37.75MB/sec (avg: 36.65MB/sec),  0.11 (avg:  0.11) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        81830.74          ---          ---         0.10982         0.11100         0.14300         0.15900         0.18300         0.19900         0.67100         0.99900         1.22300         1.33500      5433.49
Gets       818298.35      9730.40    808567.95         0.10930         0.11100         0.14300         0.15900         0.18300         0.19900         0.69500         1.00700         1.27900         1.40700     32966.98
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     900129.08      9730.40    808567.95         0.10935         0.11100         0.14300         0.15900         0.18300         0.19900         0.68700         1.00700         1.27100         1.40700     38400.47
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  29 secs]  0 threads:    96000000 ops, 3197645 (avg: 3230341) ops/sec, 193.17MB/sec (avg: 195.14MB/sec),  0.24 (avg:  0.24) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       401757.85          ---          ---         0.23760         0.27100         0.28700         0.28700         0.30300         0.31900         1.58300         1.71100         5.11900        47.87100     26636.16
Gets      4017534.28   4017534.28         0.00         0.23729         0.27100         0.28700         0.28700         0.30300         0.31900         1.55900         1.70300         1.79100        47.87100    246737.04
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    4419292.13   4017534.28         0.00         0.23732         0.27100         0.28700         0.28700         0.30300         0.31900         1.55900         1.70300         1.79100        47.87100    273373.19
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads:     9600000 ops, 1119123 (avg:  874365) ops/sec, 67.60MB/sec (avg: 52.82MB/sec),  0.09 (avg:  0.11) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        81646.80          ---          ---         0.11028         0.10300         0.14300         0.15900         0.18300         0.19900         0.69500         1.01500         1.32700         1.41500      5412.61
Gets       816458.99    816458.99         0.00         0.10997         0.10300         0.14300         0.15900         0.18300         0.19900         0.71900         1.03100         1.32700         9.15100     50142.32
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     898105.78    816458.99         0.00         0.11000         0.10300         0.14300         0.15900         0.18300         0.19900         0.71900         1.02300         1.32700         9.15100     55554.93